var httpContent = new Wrapper(new HttpContent());
var xmlContent = new Wrapper(new XmlContent());

Execute(httpContent, xmlContent);

void Execute(IContent a, IContent b)
{
    new A(a).Test();
    new B(b).Test();
    new C(a).Test();
    new D(b).Test();
}


/// შევქმნათ ოთხი კლასი + 
/// შექმენი ერთი ინტერფეისით მეთოდით GetContent() + 
/// იმ ოთხი შექმნილ კალსის კონსტრუქტორში მოვითვოვოთ ინტერფეისი + 
/// ამ ოთხივე კლასის მეთოდში გამოიტანე კონტენტის დაბრუნებყლი შედეგი კონსოლში + 
/// შევქმნათ ერთი კლასი რომელიც აიმპლემენტირებს ამ ინტერფეის +
/// მეთოდი რომელიც დააბრუნებს სტრიქონს Class name + 
/// შექმენი მეორე კლასი რომელიც დაამპილემნტირებს იგივე ინტერფეისს და დააბრუნე კლასის სახელს + 
/// დააინიციალიზე ოთხივე კლასი და კონსტრუქტორში გაადააწოდე ინტერფეისის დამაიმპლიმენტირებელი კლასი პირველს პირველი, მეორეს მეორე ,მესამეს პირველი, მეოტხეს მეორე+